The  WorksharingDisplayGraphicSettings  type exposes the following members.
 Properties
Name  |   Description
FillColor
 The fill color that will be applied to elements when these settings are applied. Note that this is automatically set by increasing the luma of the specified line color by 65%.
IsApplied
 Indicates whether this set of graphic overrides will be applied.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LineColor
 The line color that will be applied to elements when these settings are applied.
 See Also
  WorksharingDisplayGraphicSettings Class
  Autodesk.Revit.DB Namespace